{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":60,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense193063","trainable":true,"batch_input_shape":[null,76],"dtype":"float32"}},{"class_name":"Dense","config":{"units":30,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense193064","trainable":true}}],"keras_version":"tfjs-layers 1.0.4","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.4","convertedBy":null,"weightsManifest":[{"paths":["./player-nn-generation_755-individual_41.weights.bin"],"weights":[{"name":"dense_Dense193063/kernel","shape":[76,60],"dtype":"float32"},{"name":"dense_Dense193063/bias","shape":[60],"dtype":"float32"},{"name":"dense_Dense193064/kernel","shape":[60,30],"dtype":"float32"},{"name":"dense_Dense193064/bias","shape":[30],"dtype":"float32"}]}]}